test/request-response-samples/retrieve__ref_array_handling/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:impl="http://something.com/systems/2004/06/" xmlns:tns1="http://something.com/systems/2004/06/types" xmlns:intf="http://something.com/systems/2004/06/"><soap:Body><impl:retrieve xmlns:impl="http://something.com/systems/2004/06/" xmlns="http://something.com/systems/2004/06/"><impl:workItemNumber>W010201-25JUN15</impl:workItemNumber><impl:lock>false</impl:lock></impl:retrieve></soap:Body></soap:Envelope>